fix: update readme and fix structure layers
